Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.GetObjectsByBoundingBox Method
 Returns an enumerator of the given view's visible model objects that collide with the given geometrical bounding box. Note that this method uses approximate bounding boxes and thus is NOT EXACT, and may return objects not necessarily colliding with the given box but only being somewhere near to it.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetObjectsByBoundingBox(
	Point MinPoint,
	Point MaxPoint,
	View View
)
Public Function GetObjectsByBoundingBox (
	MinPoint As Point,
	MaxPoint As Point,
	View As View
) As ModelObjectEnumerator
Parameters
MinPoint
Type: Tekla.Structures.Geometry3d.Point
The minimum point of the bounding box.
MaxPoint
Type: Tekla.Structures.Geometry3d.Point
The maximum point of the bounding box.
View
Type: Tekla.Structures.Model.UI.View
The view to get the objects from.
Return Value
Type: ModelObjectEnumerator
 A model object enumerator of the visible model objects colliding with the given bounding box.
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model.UI Namespace